{
    "c4p": {
        "content": "GDG DevFest Istanbul was announced, for the sixth year in a row, the conference will bring together 1100 developers, managers and entrepreneurs on November 4 to Istanbul. This year our team is doing big advancement in the content, we're building an extra stage to accommodate more visitors and provide fife fully independent tracks on Android, Firebase, Machine Learning, Google Cloud and Web topics. Our focus is the content. We’re looking for speakers like you, who are ready to rock the stage and deliver the best talk or workshop in the field.   <div layout horizontal center-justified> <a href=\"http://gdg.ist/dfist18-cfp\" rel=\"noopener noreferrer\">   <paper-button primary>Submit a proposal</paper-button> </a> </div> ## Why is it cool to speak at the DevFest? DevFest Istanbul is not an ordinary tech conference, besides selecting only the best speakers, we help them to succeed in delivering an exceptional quality talk on the stage. Here are few perks that all our speakers get: - **Expences covered**. Hotel for 2 nights, travel costs and entrance to exclusive dinner after DevFest are covered for all speakers. - **Professional video recording**.We work with experienced video production companies to create session recording of the best quality. Stage, screen, audio, all is recorded separately and combined later. Check the session videos from the last year. - **Exposure**. By being a speaker, you are proving your level of expertise to a potential business partners or employers. Your talk will be promoted in our online resources and recording published in YouTube channel with more than 35k views. - **Unique networking**. Being a speaker means you’ll have the unique chance to network with other speakers - the best experts in the industry. -- **Coaching**. We're in the same boat, after being selected as a speaker our program committee will help you to deliver the best talk possible. We provide information about the audience, presentation templates, feedback on the slides, all to help you to prepare. What are we looking for? We're looking for **experience-based talks**, the information that can not be found in the documentation or easily googled. We're looking for your stories, your struggles, research results and experiences with the frontier tools or technologies. This year we accept submissions in two formats: - 40 minutes sessions. - 2(or 3) hours workshops. ### Talks that will not pass initial review - Talks about a specific tool/library/project explaining how it works or how to use it. - Talks whose focus is pitching a company or project. It’s cool that you mention your company during the presentation, but it shouldn’t be the focus of the talk. - Recruitment talks to attract talent. We strongly recommend you check out speaking.io website from Zach Holman. It includes good tips and guidelines for speakers. ## Timeline **Call for Papers submission deadline is October 14, 2018.** Email organizers at devfest@gdgistanbul.com  <div layout horizontal center-justified> <a href=\"http://bit.ly/df17-c4p\" rel=\"noopener noreferrer\">   <paper-button primary>Submit a proposal</paper-button> </a> </div>",
        "title": "We're looking for speakers",
        "brief": "GDG DevFest Istanbul was announced, for the sixth year in a row, the conference will bring together 1100 developers, managers and...",
        "published": "2019-09-10",
        "backgroundColor": "#3647a5",
        "source": "/data/posts/2017-02-12-c4p.md",
        "image": "/images/posts/c4p.jpg"
    }
}