{
    "101": {
        "language": "English",
        "description": "Progressive Delivery makes it easier to adopt Continuous Delivery, by deploying new versions to a subset of users and evaluating their correctness and performance before rolling them to the totality of the users, and rolled back if not matching some key metrics. Canary deployments is one of the techniques in Progressive Delivery, used in companies like Facebook to roll out new versions gradually. But good news! you don't need to be Facebook to take advantage of it.\n\nWe will demo how to create a fully automated Progressive Delivery pipeline with Canary deployments and rollbacks in Kubernetes using Jenkins X, an open source platform for cloud native CI/CD in Kubernetes, and Flagger, a project that uses Istio and Prometheus to automate Canary rollouts and rollbacks.",
        "complexity": "GDG",
        "tags": [
            "Cloud"
        ],
        "speakers": [
            "CarlosSanchez"
        ],
        "title": "Progressive Delivery: Continuous Delivery the Right Way"
    },
    "102": {
        "title": "Flashy and smooth web animations",
        "language": "English, Turkish",
        "description": "To achieve flashy and smooth animations on web browsers, a developer needs to know first how a brain perceives animations and second how a browser works. This session is about the perception of speed, browser timeline, examples and tips for flashy animations.",
        "complexity": "GDG",
        "tags": [
            "Web Technologies"
        ],
        "speakers": [
            "AlaaAlnuaimi"
        ]
    },
    "103": {
        "language": "Turkish",
        "description": "This talk introduces \"Unit testing for Android Developers\". It demonstrates why Android developers write tests, and how they start. It will also discuss how developers structure their android applications.",
        "complexity": "Beginner",
        "tags": [
            "Mobile Technologies"
        ],
        "speakers": [
            "MuratCanBUR"
        ],
        "title": "Unit Testing For Android Developers"
    },
    "104": {
        "language": "Turkish",
        "description": "findViewById() has been something Android developers tried to avoid to reduce boilerplate and we has different ways to access the views from the code side. I will give a brief introduction to how views are created from the xml, how findViewById() works and I will talk about the alternatives like ViewBindings, DataBindings, Kotlin Synthetics and how they work. I will also talk about Compose which is the future of the android UI. ",
        "complexity": "Beginner",
        "tags": [
            "Mobile Technologies"
        ],
        "speakers": [
            "HadiTok"
        ],
        "title": "Finding the view"
    },
    "105": {
        "language": "English, Turkish",
        "description": "Technology continues its fast evolution as the apps on our gadgets demand more resources to run. We need to debunk the myth that everybody has high-end phones and everybody is using high-speed networks. More than half of the people on this planet are using slow or medium speed networks, hence average mobile devices usually struggle to load complex websites.\nFrom Progressive Web Apps to route based code splitting, service workers to image optimisation, there are various ways to create fast performing websites. Using your performance budget is the key to success. This talk focuses on how our web apps need to adjust in order to achieve user happiness in terms of mobile and web.",
        "complexity": "Beginner",
        "tags": [
            "Web Technologies"
        ],
        "speakers": [
            "BilalÇınarlı"
        ],
        "title": "Why Performance Matters?"
    },
    "106": {
        "language": "English, Turkish",
        "description": "While machine learning is radically transforming many sectors, there exists the need for automating machine learning development processes in today's world. AutoML, where research spans from hypermeter optimization to neural architecture search with evolutionary algorithms or reinforcement learning, promises to democratize access to ML. Cloud AutoML by Google offers AutoML solutions for several problems. In the talk, I will briefly outline machine learning development process, how to automate it in theory, and then brainstorm about possible use cases of Cloud AutoML for non-experts and experts in ML. Does it really work? Or, how to make it work.\n",
        "complexity": "Beginner",
        "tags": [
            "Machine Learning & AI"
        ],
        "speakers": [
            "M.YusufSarıgöz"
        ],
        "title": "AutoML: AI that learns how to learn"
    },
    "107": {
        "language": "Turkish",
        "description": "Daha önce hep Kubernetes nasıl çalışır nasıl deployment yapılır onlar konuşuldu, ancak Microservice dünyasında Kubernetes tüm problemleri çözen sihirli bir tool değil.\n\nKod seviyesinde yapılan değişikliklerin infra tarafında her zaman bir karşılığı var\n\n- Boot Sürelerini Hızlandırmak \n    - Dependency Injection nasıl çalışır\n    - Runtime dependency injection ve problemleri\n    - Problemin çözümü için Compile Time Injection ve Framework ile beraberinde gelen çözümler\n    - Kubernetes tarafındaki scaling kazanımları\n- Network Optimizasyonu (GRPC)\n    - gRPC Nedir?\n    - HTTP2\n    - Kubernetes tarafında gRPC kullanırken dikkat edilmesi gerekenler ve kazanımları\n- Reactive backend uygulamaları ve Spring vs Micronaut karşılaştırması, ( bu kısım tüm sunumun kısa bir özeti olacak )",
        "complexity": "Beginner",
        "tags": [
            "Cloud"
        ],
        "speakers": [
            "MetinSeylan"
        ],
        "title": "Kubernetes Üzerinde Yüksek Performanslı Uygulamlar"
    },
    "108": {
        "language": "English, Turkish",
        "description": "Google Assistant is growing day to day. With great updates and new implementations, Assistant became the best personal digital assistant on the market. Since May 2019, Google Assistant started to support Interactive Canvas.  Using Interactive Canvas to create an Action for the Google Assistant allows us to create the best conversational interfaces with the rich visual capabilities of HTML.\n\nWith a new and emerging technology, it is always hard to understand the philosophy behind the design. In this session, we will learn how to design a basic game for Interactive Canvas.  \n\nNote: At this time, Google is only approving Canvas Actions that are gaming experiences. But you can use the same techniques to create different actions in the future. ",
        "complexity": "Beginner",
        "tags": [
            "Design"
        ],
        "speakers": [
            "ResulCanerYıldırım"
        ],
        "title": "Designing for Interactive Canvas on Google Assistant"
    },
    "109": {
        "language": "English",
        "description": "Creating a cross platform app on Flutter is really efficient but can everything be tested and automated so you assure your high quality app stays high quality over time. And if everything is test does run on IOS and Android as expected.\n\nDuring this talk we will touch upon unit testing, widget testing, screenshot testing and end to end testing and setting it up in an automated way so you can be sure that the app you build is the quality you expect it be.",
        "complexity": "Beginner",
        "tags": [
            "Mobile Technologies"
        ],
        "speakers": [
            "DylanDrost"
        ],
        "title": "How to test on you Flutter app"
    },
    "110": {
        "language": "English",
        "description": "Android engineering has come a long way. Nowadays most applications are modularized to a certain degree - to combat high compile times, enforce separation of concerns or to group code based on certain scopes.\n\nIn this talk we will take a look at navigation in modularized apps. Navigation in Android can be done explicitly by passing the class variable or implicit by sending an Intent with a certain configuration. Since modularization is supposed to simplify our dependency graph, we will take a closer look at deep linking as a navigation pattern and compare different approaches like Intent filter, a custom deeplink processor or the Android Jetpack Navigation component.\n\nAfter this talk, you will be able to modularize your application with a clean, structured and scalable navigation.",
        "complexity": "Beginner",
        "tags": [
            "Mobile Technologies"
        ],
        "speakers": [
            "DamianBurke"
        ],
        "title": "Navigation in Modular Applications with Deep Linking"
    },
    "111": {
        "language": "Turkish",
        "description": "2018 yılından beri Google AIY kitleri yardımıyla robotlarımda görüntü işleme ve sesli komut  üzerinde çalışıyorum. Robotlarıma AIY Voice kit ile birlikte Google Assistant Api'sini kullanıyorum. Robotlarıma uygulayarak TensorFlow ve Dialogflow hakkındaki bilgilerimi geliştirmeye çalışıyorum. Rehber robot ic4u2 ve öğrenci rehberi robotum BB4All üzerinde yaptığım teknik çalışmaları sunmak istiyorum. Sunumun detayında Raspberry Pi ve Arduino üzerinde Google AIY kitlerin kullanımı, mekanik zorluklar, python, TensorFlow ve DialogFlow'un RPi üzerinde kullanımını paylaşmak istiyorum.   ",
        "complexity": "Beginner",
        "tags": [
            "Robotics, assistant, machine learning and AI"
        ],
        "speakers": [
            "SelinAlaraÖrnek"
        ],
        "title": "Robotlarım ve Google"
    },
    "112": {
        "language": "Turkish",
        "description": "We're gonna build a small Android Application using Jetpack Compose.",
        "complexity": "Beginner",
        "tags": [
            "Mobile Technologies"
        ],
        "speakers": [
            "NecartiSözer"
        ],
        "title": "Simple UI Development With Jetpack Compose"
    },
    "113": {
        "language": "English",
        "description": "Thanks to machine learning and AI, applications are now being created that can see, hear, and understand the world around them. This talk will demonstrate how Google Cloud AutoML enables developers with limited machine learning expertise to build and deploy customized, high quality, tabular data, vision, translation, and natural language models by leveraging Google’s state of the art transfer learning, and Neural Architecture Search technology.",
        "complexity": "Advanced",
        "tags": [
            "Mobile Technologies"
        ],
        "speakers": [
            "NecartiSözer"
        ],
        "title": "Building Custom Models in AutoML"
    },
    "114": {
        "language": "English",
        "description": "Soon",
        "tags": [
            "Mobile Technologies"
        ],
        "speakers": [
            "SashcaWolter"
        ],
        "title": "Conversational AI Demystified: Build your bot live on stage"
    },
    "115": {
        "language": "English",
        "description": "Soon",
        "tags": [
            "Mobile Technologies"
        ],
        "speakers": [
            "VanRiper"
        ],
        "title": "Conversational AI Demystified: Build your bot live on stage"
    },
    "1000": {
        "language": "Turkish",
        "description": "Keynote",
        "complexity": "Beginner",
        "tags": [
            "All Technologies"
        ],
        "speakers": [],
        "title": "Keynote"
    },
    "1001": {
        "language": "Turkish",
        "description": "TBA",
        "complexity": "Beginner",
        "tags": [
            "Android"
        ],
        "speakers": [],
        "title": "TBA"
    },
    "1002": {
        "language": "Turkish",
        "description": "Register",
        "complexity": "Beginner",
        "tags": [
            "Android"
        ],
        "speakers": [],
        "title": "Register"
    }
}